import 'package:flutter/material.dart';
import '/backend/schema/structs/index.dart';
import 'package:shared_preferences/shared_preferences.dart';
import 'flutter_flow/flutter_flow_util.dart';

class FFAppState extends ChangeNotifier {
  static FFAppState _instance = FFAppState._internal();

  factory FFAppState() {
    return _instance;
  }

  FFAppState._internal();

  static void reset() {
    _instance = FFAppState._internal();
  }

  Future initializePersistedState() async {
    prefs = await SharedPreferences.getInstance();
    _safeInit(() {
      _fluteOverviewLessons = prefs
              .getStringList('ff_fluteOverviewLessons')
              ?.map((x) {
                try {
                  return FluteOverviewStruct.fromSerializableMap(jsonDecode(x));
                } catch (e) {
                  print("Can't decode persisted data type. Error: $e.");
                  return null;
                }
              })
              .withoutNulls
              .toList() ??
          _fluteOverviewLessons;
    });
    _safeInit(() {
      _skills = prefs
              .getStringList('ff_skills')
              ?.map((x) {
                try {
                  return SkillStruct.fromSerializableMap(jsonDecode(x));
                } catch (e) {
                  print("Can't decode persisted data type. Error: $e.");
                  return null;
                }
              })
              .withoutNulls
              .toList() ??
          _skills;
    });
    _safeInit(() {
      _notes = prefs
              .getStringList('ff_notes')
              ?.map((x) {
                try {
                  return NoteStruct.fromSerializableMap(jsonDecode(x));
                } catch (e) {
                  print("Can't decode persisted data type. Error: $e.");
                  return null;
                }
              })
              .withoutNulls
              .toList() ??
          _notes;
    });
  }

  void update(VoidCallback callback) {
    callback();
    notifyListeners();
  }

  late SharedPreferences prefs;

  List<FluteOverviewStruct> _fluteOverviewLessons = [
    FluteOverviewStruct.fromSerializableMap(jsonDecode(
        '{\"title\":\"نبذة عن آلة الناي\",\"contents\":\"[\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"معنى كلمة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"هي كلمة فارسية ومعناها المزمار وقد أطلق عليها عدة أسماء في بلدان مختلفة منها الناي القصبة، الغابة ، الشبابه ، وكلها أسماء لآلة واحد ، وهي عبارة عن قصبة جوفاء مأخوذة من نبات الغاب ، تشبه الأنبوبة مفتوح من الطرفين بها تقريباً ستة ثقوب أمامية وثقب من الخلف حيث توضع فتحته العليا علي الفم وضعاً مائلاً قليلاً بحيث يبقى جزء منها بعيدا عن الشفتين لتلقي الهواء الخارجي من الفم عند النفخ ، وذلك بزاوية مائلة تختلف من شخص إلي أخر. \\\\\\\"}\\\",\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"كيفية صناعة آلة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"يصنع الناي من نبات الغاب وهو من النباتات الطبيعية التي تتحكم الطبيعة في إنتاجها ويقل دور الإنسان في إيجاد هذا النوع من النباتات ، حيث ينمو الغاب بطبيعته علي ضفاف الأنهار وحدود الآبار ، ولم يصل الإنسان إلي وسيلة تمكنه من التحكم في أعواد الغاب من حيث الطول والقطر والسُمك والمسافة بين كل عقلة ، ونظراً لتضاؤل دور الإنسان في زراعة هذا النوع من النباتات قد لا نجد أي تصنيف أو توصيف لنبات الغاب الخاص بالناي من قبل المهتمين بالبحوث الزراعية    إلا أنه في نهاية شهر طوبة من كل عام يتم تقطيع تلك النباتات حيث تكون قد اكتملت دورة نموها في الأرض ويتم بعد ذلك تجهيز كل غابة علي حدي تمهيداً لتصنيعها عقلة مناسبة للعازف ، حيث يقوم الصانع بالمرور على عدة مراحل كل مرحله لها مقايس وحسابات خاصة.\\\\\\\"}\\\"]\"}')),
    FluteOverviewStruct.fromSerializableMap(jsonDecode(
        '{\"title\":\"الاعتناء بآلة الناي\",\"contents\":\"[\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"الطريقة الصحيحة للاعتناء بآلة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"آلة الناي من الآلات ضعيفة الهيكل البنائي ، وذلك لأن نبات الغاب عندما نقوم بقطعة يبدأ بالجفاف والتلف ، فيتحتم علينا المحافظة عليه دون إي كسر أو شرخ ، ويجب أن يكون الناي دافئ ويحفظ في مكان بعيد عن الرطوبة ، كل هذه الأشياء الأساسية تتم عن طريق عدة خطوات وهي كما يلي :- \\\\\\\\n1.\\\\\\\\tبعد الانتهاء من صناعة العقلة نقوم بمسح الناي من الخارج والداخل بالزيت وذلك لإزالة جميع الشوائب الرقيقة التي تنتج من ثقب الناي.  \\\\\\\\n2.\\\\\\\\tيفضل زيت (بذرة القطن ، أو الزيتون ، أو السمسم ، أو جوز الهند) في المحافظة على آلة الناي.  \\\\\\\\n3.\\\\\\\\tيقوم عازف الناي بوضع الناي في حقيبة مستطيلة مبطنة من الداخل بطبقة من الإسفنج والقماش ، ومن الأفضل أن تكون الحقيبة مصنوعة من الخشب حتى تحافظ على الناي من الصدمات والكسور. \\\\\\\\n4.\\\\\\\\tيجب على العازف وضع الزيت داخل وخارج العقل ، بإستخدام فرشاه طويلة أو ريشة نسر طويلة ، حيث يضع الفرشاة أو الريشة في الزيت وإدخالها إلى الناي برفق شديد ويقوم بتكرار هذا العمل عدة مرات حتى يكون الناي مشبعاً بالزيت.(1)\\\\\\\\nوهناك طريقة أخرى لوضع الزيت داخل آلة الناي وهي :-\\\\\\\\nأولاً: قبل وضع الزيت داخل الناي يجب أن تكون العقلة مستعدة لإستقبال الزيت وهذا عن طريق وضع العقل فترة لا تقل عن 15 دقيقة في الشمس وهذه المدة في فصل الشتاء أما في فصل الصيف فتكون المدة حوالي 5 دقائق تقريباً.\\\\\\\\n\\\\\\\\nثانياً: يحضر العازف كوب ويملئه بالزيت ، ثم يضع الناي في الكوب بشكل عمودياً ويقوم بإغلاق جميع الثقوب بأصابعه ويبدأ في سحب الزيت إلى داخل الناي وعندما يصل الزيت إلى فم العازف يقوم بضخة إلى الكوب ،  ثم ويقوم بتكرار هذه العملية عدة مرات متتالية حتى يتأكد أن الناي قد تشبع تماماً بالزيت ، وبعد ذلك يمسح العازف الناي من الخارج بالزيت ، ويتركه بشكل عمودي في كوب فارغ حتى يخرج الزيت الذائد منه.   \\\\\\\"}\\\"]\"}')),
    FluteOverviewStruct.fromSerializableMap(jsonDecode(
        '{\"title\":\"بعض الآراء عن دور آلة الناي في الموسيقى\",\"contents\":\"[\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"رأى سامي نصير عن دور آلة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"أن دور آلة الناي في تلك الفرق لم يتغير من حيث التواجد ولكنه تغير في طريقة أداؤه للأعمال الموسيقية لعده عوامل منها أن الأعمال الموسيقية قد تغيرت حيث بعدت عن التراث وقل التركيز على عزف القصائد والموشحات والسماعيات واللونجات والبشارف وتحولت تلك الفرق إلي فرق منوعات أو فرق مصاحبة للمطربين تحت زعم إرضاء الجمهور ، فأصبحت تلك الفرق تكثر من أداء الطقاطيق والمونولوجات.\\\\\\\\nويري المايسترو سامي نصير أن أداء بعض عازفي آلة الناي في فرق الموسيقى العربية المعاصرة أصبح منفلت حيث أن هؤلاء العازفين يغيروا من النوت المكتوبة أمامهم ولا يلتزموا بما هو مكتوب حرفيا\\\\\\\\\\\\\\\" حيث يقوموا بإضافة زخارف بلا حساب ويغيروا الطبقات الصوتية المدونة بما لا يتناسب مع الدور المكتوب له ، وهذا يعود بالناي إلي فترة التخت الشرقي البسيط المكون من خمس آلات في أوائل القرن الماضي والذي كان من سماته الزخارف والحليات الكثيرة ، وهذا الانفلات يتحمل مسئوليته القائد والعازف معاً ويعتقد المايسترو سامي نصير أن آلة الكولة بدأت تحل محل آلة الناي في فرق الموسيقى العربية المعاصرة حيث أنها تملا منطقة صوتية لا تستطيع آلة الناي ملئها وهو كان على استعداد لضمها إلي فرقة أم كلثوم للموسيقى العربية شرطا أن يلتزم العازف بالأداء الجماعي وألا يكثر من الحليات والزخارف.\\\\\\\\nوبسؤاله عن المؤلفين الموسيقيين ومدى إعطائهم دور لآلة الناي في مؤلفاتهم أجاب المايسترو سامي نصير بأن المؤلفين الموسيقيين يلجئون إلي الموزعين الموسيقيين لكتابة النوت لهم وتوزيع مؤلفاتهم في نفس الوقت وغالبا لا يكون للناي دور كبير في المؤلفات الموزعة أوركسترالياً وإنما يعطي الدور الأكبر لآلة القانون.\\\\\\\"}\\\",\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"رأى المايسترو صلاح غباشي عن دور آلة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"هو يعطي آلة الناي دور رئيسي في أداء الجمل المنفردة سواء كانت مكتوبة له أو مكتوبة لآلات أخرى مثل الأبوا والفلوت حيث أن هذه الآلات غير موجودة في فرق الموسيقى العربية في أغلب الأحيان ولا يتم إحضار هذه الآلات إلا بناء على طلب المطرب الذي يصر على وجودها .\\\\\\\\nوبسؤال المايسترو عن وجود اثنان من عازفي آلة الناي في فرقة واحدة مثل فرقة عبد الحليم نويرة أجاب بأن المقصود من هذا هو ضمان وجود عازف في حالة غياب الأخر لأي سبب وليس لعزفهم سويا الجمل المنفردة مثلما حدث في أغنية( يا مسهرني) للسيدة أم كلثوم حيث قام العازفين سيد سالم وجلال حسين بأداء الجمل المنفردة سويا.\\\\\\\\nوعن انتشار آلة الكولة في الفرق الموسيقية عموما وعن إمكانية إلحاقها بفرقة عبد الحليم نويرة أجاب بأن الفرقة تحتاج إلي عازفين على قدر عالي من الثقافة الموسيقية والقدرة على قراءة النوت الموسيقية وهو مالا يتوافر في الكثير من عازفي آلة الكولة.\\\\\\\"}\\\",\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"رأى عطية شرارة عن دور آلة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"دور آلة الناي في فرق الموسيقى العربية بدأ يختفي وأن كان هو شخصيا\\\\\\\\\\\\\\\" يصر على وجود دور لآلة الناي في أعماله خصوصا\\\\\\\\\\\\\\\" أنه مؤسس فرقة سداسي شرارة والتي تحتوي على آلة الناي ، كما أن عطية شرارة من المؤلفين الذين تعاملوا مع آلة الناي بحرفه عالية خصوصا\\\\\\\\\\\\\\\" أنه كتب كونشيرتو لآلة الناي عام 1980م كذلك فقد قام بتأليف جمل منفردة لهذه الآلة في العديد من مؤلفاته مثل مقطوعة (أمل ، ليالي المنصورة ، جبل عرفات) . \\\\\\\"}\\\",\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"رأى عبد الحميد عبد الغفار عن دور آلة الناي\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"يعتبر من أشهر عازف الناي في مصر ، وهو يعتقد أن دور آلة الناي يختلف كل عشرة أو خمسة عشر عام حيث أن عازف آلة الناي سيد سالم على سبيل المثال كان يستخدم آلة الناي للطرب ولا يظهر جمال الآلة إلا في المقامات العربية ثم جاء بعده عازف الناي حسين فاضل فبدء في إظهار آلة الناي في أداء السلالم الغربية مثل السلم الكبير والسلم الصغير وأداء جمل منفردة في المقامات العربية التي لا تحتوي على ثلاث أرباع التون ،  ثم جاء عازف الناي محمود عفت الذي قام بعزف جمع المقامات العربية والسلالم الغربية بالإضافة إلي خوض وإظهار منطقة الجوابات والقرارات لآلة الناي .\\\\\\\\n\\\\\\\\nكما يري عبد الحميد عبد الغفار أن اهتمام الملحنين القدماء مثل محمد عبد الوهاب بكتابة جمل منفردة لآلة الناي ساهم في تطور الآلة كذلك الموسيقار محمد فوزي الذي ألف عمل باسم\\\\\\\\\\\\\\\"يا ناي\\\\\\\\\\\\\\\" وقام بعزف الناي فيه العازف حسين فاضل وكان له جمل في السلم الكبير الغربي كذلك كان الناي هو الآلة الأولي في الخمسينيات داخل التخت الشرقي ولا نستطيع أن ننكر أن عازف الناي المتمكن هو الذي يجعل المؤلف الموسيقي يكتب للآلة بشكل كبير.\\\\\\\\nوإن كانت الكتابة لآلة الناي حاليا قليلة لعدم وجود مؤلفين على درجة كبير من الإجادة حيث أن المؤلفين الحالين هم مؤلفي جمل وليس مؤلفي حالة يعيشون الموقف بأكمله ، وعبد الحميد عبد الغفار أسس فرقتين الأولي هي فرقة ليالي في عام 1993م وكان عازف الناي بها هو محمد فوده وهي فرقة تجارية تحتوي على جميع الآلات الشرقية بالإضافة إلي بعض الآلات الغربية و الالكترونية ، والفرقة الثانية هي فرقة التراث للموسيقى العربية والتابعة لدار الأوبرا المصرية وقد أسسها في عام 2004م وعازف الناي بها هو ممدوح سرور، ولآلة الناي في هاتين الفرقتين دور كبير حيث يميل عبد الحميد عبد الغفار إلي توزيع الجمل المنفردة المكتوبة في المقامات الشرقية لآلة الناي ولا يعطي آلة الناي جمل منفردة في السلالم الغربية إلا في حالات نادرة .\\\\\\\"}\\\"]\"}')),
    FluteOverviewStruct.fromSerializableMap(jsonDecode(
        '{\"title\":\"أشهر عازفي الناي في مصر\",\"contents\":\"[\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"محمود عفت\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"يجيد العزف على الناي، وعندما كان طالبا في مدرسة السعيدية بمحافظة الجيزة بدأ العزف على الناي في فرقة الموسيقى بالمدرسة. حصل محمود عفت على بكالوريوس تجارة عام 1962.\\\\\\\\nفي البداية كان يعزف على الفلوت، لكنه سرعان ما تحول إلى الناي لأنه وجده أكثر انسجامًا مع روحه الشرقية.\\\\\\\\nتعلم الناي بنفسه معتمدا على الاستماع إلى عازفي الناي الكبار وكتب التربية الموسيقية في عصره.\\\\\\\\nبعد أن استطاع العزف على الناي عزف في فرق مختلفة وأسس الفرقة الماسية عام 1954 بقيادة “أحمد فؤاد حسن” وكان محمود عفت من مؤسسيها وعازف الناي بها.\\\\\\\\nلعب خلف مطربين عرب عظماء أمثال: محمد عبد الوهاب، فريد الأطرش، عبد الحليم حافظ، فايزة أحمد.\\\\\\\\nبعد وفاة أحمد فؤاد حسن شغل عفت منصب قائد الفرقة واستمر في قيادة الفرقة حتى رحيله.\\\\\\\\nيعتبر من أعظم عازفي الناي في الوطن العربي، لذلك أصبحت آلة موسيقية مهمة عندما عزف علىهابعدما كانت مرافقة للتخت الشرقي فقط.\\\\\\\\n\\\\\\\\n\\\\\\\"}\\\",\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"علي حفني\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"“علي حفني” فهو صاحب تلك النظارات السوداء التي لم تتركه قط، وكان أول فنان مصري لبسها واعتنا بها، فأصبح ذلك من بصماته.\\\\\\\\n\\\\\\\\nربما يكون السبب هو أن موهبته تكمن أيضًا في حقيقة أنه تعرض لحادث عندما كان صغيرًا، وأصيب في عينه اليمنى، وكان في غيبوبة لمدة ستة أشهر، وسجن لمدة عامين.\\\\\\\\n\\\\\\\\nذهب إلى الطبيب وحصل على نظارات سوداء عندما تعافى لأن عينيه لم تستطع تحمل الضوء وارتدى نظارة سوداء لبقية حياته.\\\\\\\\nبدأ حفني العزف في سن مبكرة، وأصبح عازفًا محترفًا في سن الخامسة عشرة، عندما تعلم شخصيًا لأول مرة ثم علم أصول مهنته، الموسيقار الكبير سيد سالم، وعمل ايضاً مع كوكب الشرق ام كلثوم.\\\\\\\\nمن المثير للاهتمام أن موسيقانا القدير رفع دعوى قضائية ضد نقابة الموسيقيين عندما كان مراهقًا، وذلك عندما تم رفضه من قبلهم لصغر سنه.\\\\\\\\n\\\\\\\\nولكن حكم القاضي بتكوين لجنه لاختباره، وبالفعل قد نجح في ذلك الاختبار الصعب.\\\\\\\\n\\\\\\\"}\\\",\\\"{\\\\\\\"title\\\\\\\":\\\\\\\"سيد سالم\\\\\\\",\\\\\\\"content\\\\\\\":\\\\\\\"هو موسيقي مصري نشأ وترعرع في بيئة فنية كانت مليئة بالشغف والإبداع. منذ صغر سنه، أبدى اهتمامًا كبيرًا بالأنغام الشرقية وأصوات الآلات التقليدية، وفي مقدمتها آلة الناي التي صارت لاحقًا رفيقته الدائمة على خشبات المسارح والفعاليات الموسيقية. تميّز سيد سالم بالموهبة الفطرية والإحساس المرهف، الأمر الذي جذب انتباه كبار الموسيقيين في مصر خلال العقود الماضية.\\\\\\\\nبدأ سيد سالم مسيرته الفنية من خلال الانضمام إلى فرق موسيقية صغيرة في الأحياء الشعبية، حيث تعلّم أساسيات العزف على الناي وأتقن تقنياته. وقد عزّز من قدراته بالاطلاع المستمر على التراث الموسيقي العربي والاستماع إلى عمالقة الفن مثل محمد عبد الوهاب وأم كلثوم وفريد الأطرش، بالإضافة إلى عازفي الناي الذين سبقوه في الميدان. خلال فترة قصيرة، أثبتت مهاراته أنه ليس مجرد عازف ناي عادي، بل صاحب رؤية موسيقية تجمع بين الأصالة والتجديد. وتمكّن من كسب احترام زملائه الموسيقيين نظير إحساسه المرهف وأدائه الفني الراقي.\\\\\\\\nمن أكثر المواقف التي تُظهر عبقرية سيد سالم وقدرته على الإبداع اللحظي هي تلك الواقعة في إحدى حفلات أم كلثوم. ففي أثناء أداء فرقة أم كلثوم لواحدة من أغانيها الشهيرة، قام سيد سالم بالخروج عن اللحن المكتوب، ليبدع ارتجالاً حيّر الحضور وأثار إعجاب السيدة أم كلثوم نفسها. استطاع بهذا الارتجال أن يضيف روحًا جديدة إلى المقطوعة الموسيقية، وأظهر مهارة فائقة في التحكم في النَّفَس والذبذبات الصوتية التي تصنع هوية الناي. هذا الارتجال لم يكن محض مصادفة، بل جاء نتيجة خبرته الطويلة وثقته في قدرته على التعبير الحر بآلة الناي. وقد باتت هذه الحادثة علامةً فارقة في تاريخ العزف الشرقي، يُشار إليها كلما ذُكر اسم سيد سالم.\\\\\\\"}\\\"]\"}'))
  ];
  List<FluteOverviewStruct> get fluteOverviewLessons => _fluteOverviewLessons;
  set fluteOverviewLessons(List<FluteOverviewStruct> value) {
    _fluteOverviewLessons = value;
    prefs.setStringList(
        'ff_fluteOverviewLessons', value.map((x) => x.serialize()).toList());
  }

  void addToFluteOverviewLessons(FluteOverviewStruct value) {
    fluteOverviewLessons.add(value);
    prefs.setStringList('ff_fluteOverviewLessons',
        _fluteOverviewLessons.map((x) => x.serialize()).toList());
  }

  void removeFromFluteOverviewLessons(FluteOverviewStruct value) {
    fluteOverviewLessons.remove(value);
    prefs.setStringList('ff_fluteOverviewLessons',
        _fluteOverviewLessons.map((x) => x.serialize()).toList());
  }

  void removeAtIndexFromFluteOverviewLessons(int index) {
    fluteOverviewLessons.removeAt(index);
    prefs.setStringList('ff_fluteOverviewLessons',
        _fluteOverviewLessons.map((x) => x.serialize()).toList());
  }

  void updateFluteOverviewLessonsAtIndex(
    int index,
    FluteOverviewStruct Function(FluteOverviewStruct) updateFn,
  ) {
    fluteOverviewLessons[index] = updateFn(_fluteOverviewLessons[index]);
    prefs.setStringList('ff_fluteOverviewLessons',
        _fluteOverviewLessons.map((x) => x.serialize()).toList());
  }

  void insertAtIndexInFluteOverviewLessons(
      int index, FluteOverviewStruct value) {
    fluteOverviewLessons.insert(index, value);
    prefs.setStringList('ff_fluteOverviewLessons',
        _fluteOverviewLessons.map((x) => x.serialize()).toList());
  }

  List<SkillStruct> _skills = [
    SkillStruct.fromSerializableMap(jsonDecode(
        '{\"name\":\"مهارة النغمات الممتدة\",\"note\":\"قد يقوم الدارس دون قصد بزيادة أو نقصان في شدة تردد النغمة الواحدة بمقدار تون كامل أثناء العزف وهذا يعتبر خطأ في العزف .\",\"description\":\"هي التحكم في شدة الهواء المار بآلة الناي للتحكم في تردد النغمة المطلوبة.\",\"exercises\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الأول\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/nghmat1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثاني\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/nghmat2.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثالث\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/nghmat3.mp4\\\\\\\"}\\\"]\",\"examples\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال مقطوعة عزيزة\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/nghmat-3ziza.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال سماعي بياتي ابراهيم العريان\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/nghmat-sama3y.mp4\\\\\\\"}\\\"]\"}')),
    SkillStruct.fromSerializableMap(jsonDecode(
        '{\"name\":\"مهارة التحكم في شدة الهواء\",\"note\":\"يستطيع الدارس إصدار أربع نغمات من آلة الناي في الوضع الواحد للأصابع ولكن باختلاف شدة الهواء المار في آلة الناي .\",\"description\":\"هي التحكم في شدة الهواء المار بآلة الناي لإصدار النغمة المطلوبة باستخدام وضع واحد للأصابع.\",\"exercises\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الأول\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ta7akom1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثاني\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ta7akom2.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثالث\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ta7akom3.mp4\\\\\\\"}\\\"]\","examples":"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال سماعي بياتي ابراهيم العريان 1\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ta7akom-sama3y-1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال سماعي بياتي ابراهيم العريان 2\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ta7akom-sama3y-2.mp4\\\\\\\"}\\\"]\"}')),
    SkillStruct.fromSerializableMap(jsonDecode(
        '{\"name\":\"مهارة القفزات اللحنية\",\"note\":\"\",\"description\":\"هي التحكم في شدة الهواء المار بآلة الناي لإصدار النغمة المطلوبة باستخدام أوضاع مختلفة للأصابع.\",\"exercises\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الأول\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qafazat1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثاني\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qafazat2.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثالث\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qafazat3.mp4\\\\\\\"]\","examples":"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال بولكا شحاتة\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qafazat-bolka.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال لونجا رياض\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qafazat-longa.mp4\\\\\\\"}\\\"]\"}')),
    SkillStruct.fromSerializableMap(jsonDecode(
        '{\"name\":\"مهارة نغمات القرار\",\"note\":\"\",\"description\":\"هي التحكم في شدة الهواء المار بآلة الناي لإصدار نغمات القرار باستخدام وضع معين للأصابع.\",\"exercises\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الأول\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qarar1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثاني\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qarar2.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثالث\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qarar3.mp4\\\\\\\"]\","examples":"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال لونجا رياض\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qarar-longa.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال سماعي بياتي ابراهيم العريان\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/qarar-sama3y.mp4\\\\\\\"}\\\"]\"}')),
    SkillStruct.fromSerializableMap(jsonDecode(
        '{\"name\":\"مهارة نغمات الجوابات\",\"note\":\"\",\"description\":\"هي التحكم في شدة الهواء المار بآلة الناي لإصدار نغمات الجواب باستخدام وضع معين للأصابع.\",\"exercises\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الأول\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/gawab1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثاني\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/gawab2.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثالث\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/gawab3.mp4\\\\\\\"]\","examples":"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال لونجا رياض 1\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/gawab-longa-1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال لونجا رياض 2\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/gawab-longa-2.mp4\\\\\\\"}\\\"]\"}')),
    SkillStruct.fromSerializableMap(jsonDecode(
        '{\"name\":\"مهارة أنصاف الفتحات\",\"note\":\"\",\"description\":\"هي التحكم في شدة الهواء المار بآلة الناي لإصدار النغمات المطلوبة باستخدام وضع أنصاف الفتحات.\",\"exercises\":\"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الأول\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ansaf1.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثاني\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ansaf2.mp4\\\\\\\"}\\\",\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"المستوى الثالث\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ansaf3.mp4\\\\\\\"]\","examples":"[\\\"{\\\\\\\"name\\\\\\\":\\\\\\\"مثال بولكا شحاتة\\\\\\\",\\\\\\\"video\\\\\\\":\\\\\\\"assets/videos/ansaf-bolka.mp4\\\\\\\"}\\\"]\"}'))
  ];
  List<SkillStruct> get skills => _skills;
  set skills(List<SkillStruct> value) {
    _skills = value;
    prefs.setStringList('ff_skills', value.map((x) => x.serialize()).toList());
  }

  void addToSkills(SkillStruct value) {
    skills.add(value);
    prefs.setStringList(
        'ff_skills', _skills.map((x) => x.serialize()).toList());
  }

  void removeFromSkills(SkillStruct value) {
    skills.remove(value);
    prefs.setStringList(
        'ff_skills', _skills.map((x) => x.serialize()).toList());
  }

  void removeAtIndexFromSkills(int index) {
    skills.removeAt(index);
    prefs.setStringList(
        'ff_skills', _skills.map((x) => x.serialize()).toList());
  }

  void updateSkillsAtIndex(
    int index,
    SkillStruct Function(SkillStruct) updateFn,
  ) {
    skills[index] = updateFn(_skills[index]);
    prefs.setStringList(
        'ff_skills', _skills.map((x) => x.serialize()).toList());
  }

  void insertAtIndexInSkills(int index, SkillStruct value) {
    skills.insert(index, value);
    prefs.setStringList(
        'ff_skills', _skills.map((x) => x.serialize()).toList());
  }

  List<NoteStruct> _notes = [];
  List<NoteStruct> get notes => _notes;
  set notes(List<NoteStruct> value) {
    _notes = value;
    prefs.setStringList('ff_notes', value.map((x) => x.serialize()).toList());
  }

  void addToNotes(NoteStruct value) {
    notes.add(value);
    prefs.setStringList('ff_notes', _notes.map((x) => x.serialize()).toList());
  }

  void removeFromNotes(NoteStruct value) {
    notes.remove(value);
    prefs.setStringList('ff_notes', _notes.map((x) => x.serialize()).toList());
  }

  void removeAtIndexFromNotes(int index) {
    notes.removeAt(index);
    prefs.setStringList('ff_notes', _notes.map((x) => x.serialize()).toList());
  }

  void updateNotesAtIndex(
    int index,
    NoteStruct Function(NoteStruct) updateFn,
  ) {
    notes[index] = updateFn(_notes[index]);
    prefs.setStringList('ff_notes', _notes.map((x) => x.serialize()).toList());
  }

  void insertAtIndexInNotes(int index, NoteStruct value) {
    notes.insert(index, value);
    prefs.setStringList('ff_notes', _notes.map((x) => x.serialize()).toList());
  }
}

void _safeInit(Function() initializeField) {
  try {
    initializeField();
  } catch (_) {}
}

Future _safeInitAsync(Function() initializeField) async {
  try {
    await initializeField();
  } catch (_) {}
}
